
import webbrowser

import os


code_dict = {
    
    # Первая группа (Служебные и русские строчные)
    " ": "0000 0010",
    'а': '0000 0011',
    'б': '0000 0100',
    'в': '0000 0101',
    'г': '0000 0110',
    'д': '0000 0111',
    'е': '0000 1000',
    'ж': '0000 1001',
    'з': '0000 1010',
    'и': '0000 1011',
    'й': '0000 1100',
    'к': '0000 1101',
    'л': '0000 1110',
    'м': '0000 1111',
    'н': '0001 0000',
    'о': '0001 0010',
    'п': '0001 0011',
    'р': '0001 0100',
    'с': '0001 0101',
    'т': '0001 0110',
    'у': '0001 0111',
    'ф': '0001 1000',
    'х': '0001 1001',
    'ц': '0001 1010',
    'ч': '0001 1011',
    'ш': '0001 1100',
    'щ': '0001 1101',
    'ъ': '0001 1110',
    'ы': '0001 1111',
    'ь': '0010 0000',
    'э': '0010 0001',
    'ю': '0010 0010',
    'я': '0010 0011',
    'і': '0010 0100',
    'ї': '0010 0101',
    'є': '0010 0110',

    # Вторая группа (Цифры и знаки)
    '1': '0010 0111',
    '2': '0010 1000',
    '3': '0010 1001',
    '4': '0010 1010',
    '5': '0010 1011',
    '6': '0010 1100',
    '7': '0010 1101',
    '8': '0010 1110',
    '9': '0010 1111',
    '0': '0011 0000',
    '%': '0011 0001',
    ')': '0011 0010',
    '(': '0011 0011',
    '.': '0011 0100',
    ',': '0011 0101',

    # Третья группа (Русские прописные буквы)
    'А': '0011 0110',
    'Б': '0011 0111',
    'В': '0011 1000',
    'Г': '0011 1001',
    'Д': '0011 1010',
    'Е': '0011 1011',
    'Ж': '0011 1100',
    'З': '0011 1110',
    'И': '0011 1111',
    'Й': '0100 0000',
    'К': '0100 0001',
    'Л': '0100 0010',
    'М': '0100 0011',
    'Н': '0100 0100',
    'О': '0100 0101',
    'П': '0100 0110',
    'Р': '0100 0111',
    'С': '0100 1000',
    'Т': '0100 1001',
    'У': '0100 1010',
    'Ф': '0100 1011',
    'Х': '0100 1100',
    'Ц': '0100 1101',
    'Ч': '0100 1110',
    'Ш': '0100 1111',
    'Щ': '0101 0000',
    'Ъ': '0101 0001',
    'Ы': '0101 0010',
    'Ь': '0101 0011',
    'Э': '0101 0100',
    'Ю': '0101 0101',
    'Я': '0101 0110',

    # Четвертая группа (Английские прописные буквы)
    'Q': '0101 0111',
    'W': '0101 1000',
    'E': '0101 1001',
    'R': '0101 1010',
    'T': '0101 1011',
    'Y': '0101 1100',
    'U': '0101 1101',
    'I': '0101 1110',
    'O': '0101 1111',
    'P': '0110 0000',
    'A': '0110 0001',
    'S': '0110 0010',
    'D': '0110 0011',
    'F': '0110 0100',
    'G': '0110 0101',
    'H': '0110 0110',
    'J': '0110 0111',
    'K': '0110 1000',
    'L': '0110 1001',
    'Z': '0110 1010',
    'X': '0110 1011',
    'C': '0110 1100',
    'V': '0110 1101',
    'B': '0110 1110',
    'N': '0110 1111',
    'M': '0111 0000',

    # Пятая группа (Знаки препинания и английские строчные)
    '?': '0111 0001',
    '"': '0111 0010',
    '!': '0111 0011',
    ';': '0111 0100',
    ':': '0111 0101',
    'q': '0111 0110',
    'w': '0111 0111',
    'e': '0111 1000',
    'r': '0111 1001',
    't': '0111 1010',
    'y': '0111 1011',
    'u': '0111 1100',
    'i': '0111 1101',
    'o': '0111 1110',
    'p': '0111 1111',
    'a': '1000 0000',
    's': '1000 0001',
    'd': '1000 0010',
    'f': '1000 0011',
    'g': '1000 0100',
    'h': '1000 0101',
    'j': '1000 0110',
    'k': '1000 0111',
    'l': '1000 1000',
    'z': '1000 1001',
    'x': '1000 1010',
    'c': '1000 1011',
    'v': '1000 1100',
    'b': '1000 1101',
    'n': '1000 1110',
    'm': '1000 1111',

    # Шестая группа (Математические символы в конце таблицы)
    '*': '1001 0000',
    '@': '1001 0001',
    '#': '1001 0010',
    '$': '1001 0011',
    '^': '1001 0100',
    '&': '1001 0101',
    '-': '1001 0110',
    '_': '1001 0111',
    '=': '1001 1000',
    '+': '1001 1001',
    '[': '1001 1010',
    ']': '1001 1011',
    '{': '1001 1100',
    '}': '1001 1101',
    '/': '1001 1110',
    '\\': '1001 1111'
}


   
def this_delete():
    try:
       global thisfile
       if os.path.exists(f_path):
           os.remove(f_path) 
           thisfile = [] 
           print("Файл успешно удален с диска!")
       else:
           print("Файл не существует или уже удален.")
    except FileNotFound: print("Файл не существует или уже удален.")
    

def binar_read():
    with open(f"{filename}.txt", 'r', encoding='utf-8') as br:
        print (br.read())



def shifr():
 global thisfile
 inp=input('Что вы хотите зашифровать?\n')
 result = [] 
 for char in inp:
    if char in code_dict:
        result.append(code_dict[char])
    else:
        result.append('')
 outp = " | ".join(result)
 print(outp)
 thisfile.append(outp)
    
    
 file_content = "\n".join(thisfile)
 with open(f_path, "w", encoding="utf-8") as f:
    f.write(file_content)
    


 print(f"Количество бит: {len(result)*8} .")
 print(f"Количество байт: {len(result)} .")
def unshifr():
    
    inp2 = input('Что вы хотите расшифровать? (вводите коды через | )\n')
    
    # .split(" | ") разрезает введенный текст на список отдельных кодов
    codes = inp2.split(" | ")
    decoded_output = ""
    
    for code in codes:
        code = code.strip() 
        found = False
        
        # Бежим по словарю и ищем
        for key, value in code_dict.items():
            if value == code:
                decoded_output += key 
                found = True
                break 
                
        if not found:
            decoded_output += "[?]"
            
    print("Результат расшифровки:")
    print(decoded_output)
def konvertt():
    try:
        with open(f"{filename}.txt", 'r', encoding='utf-8') as konfile:
            
            lines = konfile.read().splitlines()
            
        decoded_output = ""
        
        for line in lines:
            
            if not line.strip() or "|" not in line:
                continue
                
            
            codes = line.split(" | ")
            
            for code in codes:
                code = code.strip()
                if not code:  
                    continue
                    
                found = False
                for key, value in code_dict.items():
                    if value == code:
                        decoded_output += key
                        found = True
                        break
                        
                if not found:
                    decoded_output += "[?]"
            
            
            decoded_output += "\n"
                
        print("Результат расшифровки содержимого файла:")
        print(decoded_output.strip())   
    except FileNotFoundError:
        print(f"Ошибка: в файле {filename}.txt еще ничего нет!")

print("===Добро пожаловать в ШИФРАТОР 1.1!===")
print("Только благодаря этой программе вы можете прочитать зашифрованные в этом формате файлы!")
print("Эта программа способна работать с файлами: читать, шифровать, и даже удалять")
print("И это Open Source!")
print("Будте аккуратны при использовании этого ПО, так оно может удалять файлы!")
filename = input("Введите название файла, с которым хотите работать(без формата)\n")
f_path = f'{filename}.txt'
if os.path.exists(f_path):
    with open(f_path, "r", encoding="utf-8") as f:
        thisfile = f.read().splitlines()
else:
    thisfile = []
    
while True:
 
 
 print("1.Ввод текста с последующим шифрованием")
 print("2.Ввод текста с последущей расшифровкой")
 print("3.Расшифровать текущий файл")
 print("4.Показать словарь")
 print("5.Удалить текущий файл")
 print('6.Показать бинарный вид файла')
 try:
        comand = int(input("Просто введите цифру\n"))
         
        
        if comand == 4:
            print(code_dict)

        elif comand == 6:
            binar_read()
        elif comand == 5:
            this_delete()
        elif comand == 3:
            konvertt()
        elif comand == 1: 
            shifr()
        elif comand == 2:
            unshifr()
        else: 
            print('error: введите 1, 2 или 3')
            
 except ValueError:  
        print("Вы ввели что то не так\n :(")
        